package View;

/**
 * Класс для текста интерфейса пользователя
 */
public class UiText {

    public String inputData = "Введите данные в произвольном порядке, разделенные пробелом:\n\n" +
            "   Фамилия Имя Отчество (Начните с фамилии)\n" +
            "   Дата рождения (dd.mm.yyyy)\n" +
            "   Номер телефона(целое беззнаковое число без форматирования)\n" +
            "   Пол (символ латиницей f или m)\n\n" +
            "Или введите QUIT для выхода";

    public String pressEnter = "Нажмите ENTER для продолжения";
    public String successSave = "Успешно записан в файл";
    
}
